class Symptomdata {
  String title;
  String description;
  String color;
  Symptomdata(this.title, this.description, this.color);
}

List<Symptomdata> symptomDatas = [
  Symptomdata(
      "អាការរោគ ដែលជួបញឹកញាប់",
      "គ្រុនក្តៅ​ - ក្អកស្ងួត​ - អស់កម្លាំង - មិនអាចដឹងក្លិននិងរសជាតិ ",
      "Colors.blue"),
  Symptomdata("អាការរោគ ដែលជួបមិនសូវញឹកញាប់",
      "ដកដង្ហើមមិនបានវែង - ឈឺក្នុងខ្លួន - ឈឺបំពង់ក", "Colors.blue"),
  Symptomdata(
      "អាការរោគ ដែលកម្រជាប់", "រាគរួស - ហៀរសំបោរ - តឹងច្រមុះ", "Colors.blue"),
  Symptomdata(
      "វិធីត្រួតពិនិត្រអាការជាមូលដ្ធានប្រចាំថ្ងៃ",
      "ទប់ដង្ហើមអោយបាន 10វិនាទី បើសិនអ្នកអាចធ្វើបានដោយមិនក្អក ឬ មានអារម្មណ៏ណែនដើមទ្រូងមានន័យថាអ្នកមិនបានឆ្លងទេ។",
      "Colors.blue"),
  Symptomdata(
      "អាការរោគរបស់អ្នកឆ្លង នៅថ្ងៃទី1 - 3",
      "ស្រដៀងផ្តាសាយធម្មតា - ឈឺបំពង់ក - មិនអស់កម្លាំងនិងកម្តៅធម្មតា - បរិភោគអាហារបានធម្មតា",
      "Colors.blue"),
  Symptomdata(
      "អាការរោគរបស់អ្នកឆ្លង នៅថ្ងៃទី4",
      "ឈឺបំពង់ក - ឈឺកពេលនិយាយ​​ - កម្តៅធម្មតា(36.5 c) - បរិភោគអាហារមិនសូវបាន - ឈឺក្បាល - រាគរួសតិចតួច - ធីងធោង(ដូចស្រវឹង)",
      "Colors.blue"),
  Symptomdata("អាការរោគរបស់អ្នកឆ្លងនៅថ្ងៃទី5",
      "ឈឺកពេលនិយាយ​ - អស់កម្លាំង - កម្តៅ(36.5 - 37.5 c) - ឈឺក", "Colors.blue"),
  Symptomdata(
      "អាការរោគរបស់អ្នកឆ្លង នៅថ្ងៃទី6",
      "កម្តៅ(លើសពី37 c)​ - ក្អកស្ងួត - ឈឺកពេលនិយាយឬបរិភោគអាហារ - អស់កម្លាំង - ពិបាកដកដង្ហើម - ឈឺម្រាមដៃ - រាគ",
      "Colors.blue"),
  Symptomdata(
      "អាការរោគរបស់អ្នកឆ្លង នៅថ្ងៃទី7",
      "កម្តៅ(37.4 - 37.8 c) - ក្អកជាប់មានស្លេស្ម -​ ឈឺរាងកាយនិងក្បាល - រាគរួស - ក្អួត",
      "Colors.blue"),
  Symptomdata("អាការរោគរបស់អ្នកឆ្លង នៅថ្ងៃទី8",
      "កម្តៅ(38 c) - ពិបាកដកដង្ហើម - ក្អកជាប់ - ឈឺក្បាល", "Colors.blue"),
  Symptomdata(
      "អាការរោគរបស់អ្នកឆ្លង នៅថ្ងៃទី9",
      "អាការមិនធូរស្រាល - កម្តៅឡើងខ្លាំង - ពិបាកដកដង្ហើមខ្លាំងត្រូវការបញ្ចូលអុកស៊ីសែន",
      "Colors.blue"),
];
